{
  "words": [
    {
      "word": "ubiquitous",
      "definition": "present, appearing, or found everywhere",
      "example": "Smartphones have become ubiquitous in modern society."
    },
    {
      "word": "serendipity",
      "definition": "the occurrence and development of events by chance in a happy or beneficial way",
      "example": "It was pure serendipity that they met and became best friends."
    },
    {
      "word": "quintessential",
      "definition": "representing the most perfect or typical example of a quality or class",
      "example": "She is the quintessential professional, always prepared and organised."
    },
    {
      "word": "ephemeral",
      "definition": "lasting for a very short time",
      "example": "The beauty of the cherry blossoms is ephemeral, lasting only a few days."
    },
    {
      "word": "alacrity",
      "definition": "brisk and cheerful readiness",
      "example": "She accepted the invitation with alacrity, eager to attend the event."
    },
    {
      "word": "aberration",
      "definition": "a departure from what is normal, usual, or expected, typically an unwelcome one",
      "example": "The storm was an aberration; the weather had been perfect all week."
    },
    {
      "word": "capitulate",
      "definition": "cease to resist an opponent or an unwelcome demand; surrender",
      "example": "The soldiers had to capitulate after being surrounded."
    },
    {
      "word": "debilitate",
      "definition": "make (someone) very weak and infirm",
      "example": "The disease can debilitate even the strongest individuals."
    },
    {
      "word": "elucidate",
      "definition": "make (something) clear; explain",
      "example": "The professor was able to elucidate the complex theory."
    },
    {
      "word": "fervent",
      "definition": "having or displaying a passionate intensity",
      "example": "He was a fervent supporter of the campaign."
    },
    {
      "word": "gregarious",
      "definition": "fond of company; sociable",
      "example": "She was a gregarious and outgoing person."
    },
    {
      "word": "hapless",
      "definition": "unfortunate",
      "example": "The hapless traveller lost his passport on the first day."
    },
    {
      "word": "iconoclast",
      "definition": "a person who attacks or criticises cherished beliefs or institutions",
      "example": "The artist was known as an iconoclast for his controversial works."
    },
    {
      "word": "juxtapose",
      "definition": "place or deal with close together for contrasting effect",
      "example": "The exhibition juxtaposes modern art with classical pieces."
    },
    {
      "word": "laconic",
      "definition": "(of a person, speech, or style of writing) using very few words",
      "example": "His laconic reply suggested he was not interested in the conversation."
    },
    {
      "word": "malaise",
      "definition": "a general feeling of discomfort, illness, or unease whose exact cause is difficult to identify",
      "example": "A general malaise was apparent among the workers."
    },
    {
      "word": "nefarious",
      "definition": "(typically of an action or activity) wicked or criminal",
      "example": "The villain's nefarious plot was uncovered by the heroes."
    },
    {
      "word": "obfuscate",
      "definition": "render obscure, unclear, or unintelligible",
      "example": "The politician obfuscated the issue with complex jargon."
    },
    {
      "word": "paragon",
      "definition": "a person or thing regarded as a perfect example of a particular quality",
      "example": "She is a paragon of virtue."
    },
    {
      "word": "quixotic",
      "definition": "exceedingly idealistic; unrealistic and impractical",
      "example": "His quixotic plans were never going to succeed."
    },
    {
      "word": "resplendent",
      "definition": "attractive and impressive through being richly colourful or sumptuous",
      "example": "The ballroom was resplendent with decorations."
    },
    {
      "word": "sycophant",
      "definition": "a person who acts obsequiously towards someone important in order to gain advantage",
      "example": "The manager was surrounded by sycophants."
    },
    {
      "word": "taciturn",
      "definition": "(of a person) reserved or uncommunicative in speech; saying little",
      "example": "The taciturn man rarely spoke in meetings."
    },
    {
      "word": "ubiquitous",
      "definition": "present, appearing, or found everywhere",
      "example": "Smartphones have become ubiquitous in modern society."
    },
    {
      "word": "voracious",
      "definition": "wanting or devouring great quantities of food",
      "example": "He had a voracious appetite after the hike."
    },
    {
      "word": "zealous",
      "definition": "having or showing zeal",
      "example": "The volunteers were zealous in their efforts to help the community."
    },
    {
      "word": "ameliorate",
      "definition": "make (something bad or unsatisfactory) better",
      "example": "Measures were taken to ameliorate the situation."
    },
    {
      "word": "benevolent",
      "definition": "well meaning and kindly",
      "example": "The benevolent woman donated a large sum to charity."
    },
    {
      "word": "cognizant",
      "definition": "having knowledge or being aware of",
      "example": "He was cognizant of the risks involved."
    },
    {
      "word": "disparage",
      "definition": "regard or represent as being of little worth",
      "example": "He never missed an opportunity to disparage his competitors."
    },
    {
      "word": "equanimity",
      "definition": "mental calmness, composure, and evenness of temper, especially in a difficult situation",
      "example": "She accepted the bad news with equanimity."
    },
    {
      "word": "fortuitous",
      "definition": "happening by accident or chance rather than design",
      "example": "Their meeting was entirely fortuitous."
    },
    {
      "word": "grandiloquent",
      "definition": "pompous or extravagant in language, style, or manner, especially in a way that is intended to impress",
      "example": "The politician's grandiloquent speech did not impress the audience."
    },
    {
      "word": "harangue",
      "definition": "a lengthy and aggressive speech",
      "example": "He delivered a harangue against the government's policies."
    },
    {
      "word": "imperturbable",
      "definition": "unable to be upset or excited; calm",
      "example": "Her imperturbable demeanor helped to calm the nervous crowd."
    },
    {
      "word": "juxtapose",
      "definition": "place or deal with close together for contrasting effect",
      "example": "The artist juxtaposed vibrant colours with dull hues."
    },
    {
      "word": "kudos",
      "definition": "praise and honour received for an achievement",
      "example": "She received kudos for her hard work on the project."
    },
    {
      "word": "languid",
      "definition": "displaying or having a disinclination for physical exertion or effort; slow and relaxed",
      "example": "The hot weather made them languid and lethargic."
    },
    {
      "word": "misanthrope",
      "definition": "a person who dislikes humankind and avoids human society",
      "example": "The old man was a misanthrope who avoided his neighbours."
    },
    {
      "word": "nonchalant",
      "definition": "(of a person or manner) feeling or appearing casually calm and relaxed; not displaying anxiety, interest, or enthusiasm",
      "example": "She gave a nonchalant shrug when asked about her plans."
    },
    {
      "word": "ostentatious",
      "definition": "characterised by vulgar or pretentious display; designed to impress or attract notice",
      "example": "Her ostentatious jewellery attracted everyone's attention."
    },
    {
      "word": "perfunctory",
      "definition": "(of an action or gesture) carried out with a minimum of effort or reflection",
      "example": "He gave a perfunctory nod and continued with his work."
    },
    {
      "word": "quandary",
      "definition": "a state of perplexity or uncertainty over what to do in a difficult situation",
      "example": "She was in a quandary about whether to accept the job offer."
    },
    {
      "word": "recalcitrant",
      "definition": "having an obstinately uncooperative attitude towards authority or discipline",
      "example": "The recalcitrant student refused to follow the rules."
    },
    {
      "word": "sagacious",
      "definition": "having or showing keen mental discernment and good judgement; wise or shrewd",
      "example": "The sagacious leader made decisions that benefitted everyone."
    },
    {
      "word": "tacit",
      "definition": "understood or implied without being stated",
      "example": "There was a tacit agreement between the two companies."
    },
    {
      "word": "unctuous",
      "definition": "(of a person) excessively or ingratiatingly flattering; oily",
      "example": "His unctuous demeanor made everyone distrust him."
    },
    {
      "word": "vociferous",
      "definition": "vehement or clamorous",
      "example": "The vociferous crowd demanded justice."
    },
    {
      "word": "waft",
      "definition": "pass or cause to pass gently through the air",
      "example": "The smell of freshly baked bread wafted through the air."
    },
    {
      "word": "xenophobia",
      "definition": "dislike of or prejudice against people from other countries",
      "example": "The rise in xenophobia worried many community leaders."
    },
    {
      "word": "yearn",
      "definition": "have an intense feeling of longing for something, typically something that one has lost or been separated from",
      "example": "She yearned for the days when they were together."
    },
    {
      "word": "zenith",
      "definition": "the time at which something is most powerful or successful",
      "example": "The company reached its zenith in the early 2000s."
    }
  ]
}
